app/views/patients/_form.html.haml

          %label
            = check_box_tag 'patient[medication_ids][]', medication.id, @patient.medications.include?(medication)
---
SELECT `medications`.* FROM `medications`