app/controllers/medications_controller.rb

  def index
    @medications = if !params[:q].blank?
      Medication.where("name LIKE ? OR company LIKE ? OR adverse_reactions LIKE ? OR generic_option LIKE ?", "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%")
    else
    @medications = Medication.all
---
SELECT `medications`.* FROM `medications`