app/controllers/patients_controller.rb

SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
SELECT `medications`.* FROM `medications`
---
  def new
    @clinic = Clinic.find params[:clinic_id]
    @patient = @clinic.patients.new
    @medications = Medication.all

SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
INSERT INTO `patients` (`first_name`, `last_name`, `date_of_birth`, `description`, `gender`, `blood_type`, `clinic_id`, `workflow_state`, `created_at`, `updated_at`) VALUES ('Maddie', 'Dog', '2001-07-07', 'sick', 'male', 'O+', 1, 'waiting_room', '2015-02-26 02:46:20.699524', '2015-02-26 02:46:20.699524')
---
  def create
    @clinic = Clinic.find params[:clinic_id]
    @patient = @clinic.patients.create patient_params